Test-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: Test-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: Test-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  Test-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1440,812)
      - go(https://qa.app.psynap-sys.com/auth/login)
      - openWindow()
      - switchWindow(win_ser_1)
      - go(https://qa.app.psynap-sys.com/)
      - waitForByID(mantine-ci9scixe7,Clickable): 10s
      - typeByID(mantine-ci9scixe7): "sainath.gaikwad+450@thinkitive.com"
      - waitForByID(mantine-g0f6mudk3,Clickable): 10s
      - typeSecretByID(mantine-g0f6mudk3): "Sai1234#"
      - waitForByID(mantine-ulloirpiy,Clickable): 10s
      - clickByID(mantine-ulloirpiy)
      - waitForByID(mantine-ulloirpiy,Clickable): 10s
      - typeByID(mantine-ulloirpiy): "test"
      - waitForByCSS(span.m_80f1301b.mantine-Button-inner,Clickable): 10s
      - clickByCSS(span.m_80f1301b.mantine-Button-inner)
      - waitForByCSS(span.m_8d3afb97.mantine-ActionIcon-icon > svg,Clickable): 10s
      - clickByCSS(span.m_8d3afb97.mantine-ActionIcon-icon > svg)
      - waitForByID(mantine-09bgkimqj,Clickable): 10s
      - clickByID(mantine-09bgkimqj)
      - waitForByID(mantine-09bgkimqj,Clickable): 10s
      - typeByID(mantine-09bgkimqj): "Ghor"
      - 'waitForByCSS(button:nth-of-type(2) > span > span,Clickable)': 10s
      - 'clickByCSS(button:nth-of-type(2) > span > span)'
      - 'waitForByCSS(button:nth-of-type(2) > span > span,Clickable)': 10s
      - 'clickByCSS(button:nth-of-type(2) > span > span)'
      - 'waitForByCSS(button:nth-of-type(2) > span > span,Clickable)': 10s
      - 'clickByCSS(button:nth-of-type(2) > span > span)'
      - 'waitForByCSS(button:nth-of-type(2) > span > span,Clickable)': 10s
      - 'clickByCSS(button:nth-of-type(2) > span > span)'
      - 'waitForByCSS(button:nth-of-type(2) > span > span,Clickable)': 10s
      - 'clickByCSS(button:nth-of-type(2) > span > span)'
      - 'waitForByCSS(button:nth-of-type(2) > span > span,Clickable)': 10s
      - 'doubleClickByCSS(button:nth-of-type(2) > span > span)'
      - 'waitForByCSS(button:nth-of-type(2) > span > span,Clickable)': 10s
      - 'clickByCSS(button:nth-of-type(2) > span > span)'
      - waitForByID(mantine-t5m36nkav,Clickable): 10s
      - clickByID(mantine-t5m36nkav)
      - waitForByID(mantine-t5m36nkav,Clickable): 10s
      - clickByID(mantine-t5m36nkav)
      - waitForByCSS(button.mantine-focus-auto.mantine-active.m_220c80f2.m_606cb269.mantine-Modal-close.m_86a44da5.mantine-CloseButton-root.m_87cf2631.mantine-UnstyledButton-root > svg > path,Clickable): 10s
      - clickByCSS(button.mantine-focus-auto.mantine-active.m_220c80f2.m_606cb269.mantine-Modal-close.m_86a44da5.mantine-CloseButton-root.m_87cf2631.mantine-UnstyledButton-root > svg > path)

  Test-Http:
    headers:
      sec-ch-ua: '"Google Chrome";v="137", "Chromium";v="137", "Not/A)Brand";v="24"'
      sec-ch-ua-mobile: '?0'
      sec-ch-ua-platform: '"macOS"'
      Upgrade-Insecure-Requests: '1'
      User-Agent: >-
        Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36
        (KHTML, like Gecko) Chrome/137.0.0.0 Safari/537.36
      Accept: >-
        text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: https://qa.app.psynap-sys.com/
            method: GET
            label: https://qa.app.psynap-sys.com/
            think-time: 0ms
            headers: {}